vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/CRC_TYPE_A_registers.h
/* Common CRC_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32f427, stm32g070, stm32h503, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "CRC_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t DR            :32; // /*!< Data register bits */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_crc_type_a,dr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_crc_type_a,dr),bits);

typedef union {
	struct {
		uint32_t IDR           : 8; // Independent data register
		uint32_t _reserved8    :24;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_crc_type_a,idr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_crc_type_a,idr),bits);

typedef union {
	struct {
		uint32_t RESET         : 1; // /*!< RESET the CRC computation unit bit */
		uint32_t _reserved1    : 2;
		uint32_t POLYSIZE      : 2; // /*!< Polynomial size bits */
		uint32_t REV_IN        : 2; // /*!< REV_IN Reverse Input Data bits */
		uint32_t REV_OUT       : 1; // /*!< REV_OUT Reverse Output Data bits */
		uint32_t _reserved8    :24;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_crc_type_a,cr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_crc_type_a,cr),bits);

typedef union {
	struct {
		uint32_t INIT          :32; // /*!< Initial CRC value bits */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_crc_type_a,init);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_crc_type_a,init),bits);

typedef union {
	struct {
		uint32_t POL           :32; // /*!< Coefficients of the polynomial */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_crc_type_a,pol);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_crc_type_a,pol),bits);

typedef union {
	struct {
		REGDEF_NAME(com_crc_type_a,dr) DR;
		REGDEF_NAME(com_crc_type_a,idr) IDR;
		REGDEF_NAME(com_crc_type_a,cr) CR;
		uint32_t _reserved0xC;
		REGDEF_NAME(com_crc_type_a,init) INIT;
		REGDEF_NAME(com_crc_type_a,pol) POL;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,crc_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,crc_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,crc_type_a), DR) != 0, "Offset mismatch for DR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,crc_type_a), CR) != 8, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,crc_type_a), INIT) != 16, "Offset mismatch for INIT");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,crc_type_a), IDR) != 4, "Offset mismatch for IDR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,crc_type_a), POL) != 20, "Offset mismatch for POL");
